Revit 2027 API
CircleLightShape Constructor
 Creates a circle light shape object with 2.0' emit diameter.
Namespace: Autodesk.Revit.DB.Lighting
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public CircleLightShape()
Public Sub New
public:
CircleLightShape()
new : unit -> CircleLightShape
See Also
Reference
CircleLightShape Class
CircleLightShape Overload
Autodesk.Revit.DB.Lighting Namespace